Repository: simonsablowski/simsab
Catalog: locales/*.po
Languages: de

source: en
de: de

source: http://www.simsab.net/en
de: http://www.simsab.net/de

source: Simon Sablowski is a developer and architect for web applications with more than ten years of experience. His main focus lies with core and backend development, software architecture, technical conception, prototyping, refactoring and database design.
de: Simon Sablowski ist Entwickler und Architekt für Web-Anwendungen mit mehr als zehn Jahren Erfahrung. Schwerpunktmäßig arbeitet er im Bereich Core- und Backend-Entwicklung, Software-Architektur, technische Konzeption, Prototyping, Refactoring und Datenbank-Design.

source: simon sablowski, sablowski, berlin, web development, software architecture, technical conception, prototyping, refactoring, database design, php, mysql, oop, mvc
de: simon sablowski, sablowski, berlin, web-entwicklung, software-architektur, technische konzeption, prototyping, refactoring, datenbank-design, php, mysql, oop, mvc

source: about-me
de: ueber-mich

source: About Me
de: Über mich

source: skills
de: kompetenzen

source: Skills
de: Kompetenzen

source: projects
de: projekte

source: Projects
de: Projekte

source: career
de: karriere

source: Career
de: Karriere

source: contact-me
de: kontakt

source: Contact Me
de: Kontakt

source: de
de: en

source: Deutsche Version
de: English version

source: I am a passionate developer and architect for web applications with more than ten years of experience and have contributed my expertise and creativity to more than 100 exciting projects.
de: Ich bin leidenschaftlicher Entwickler und Architekt für Web-Anwendungen mit mehr als zehn Jahren Erfahrung. Meine Expertise und Kreativität habe ich in mehr als 100 aufregende Projekte eingebracht.

source: While specializing in the use of <em>PHP</em>, I strive to maintain the highest standards in terms of efficiency, manageability and reusability of my software. My work follows design patterns, is redundancy-free, modular and performance-optimized.
de: Spezialisiert habe ich mich auf den Einsatz von <em>PHP</em>. Dabei lege ich Wert auf Effizienz, Wartbarkeit und Wiederverwendbarkeit meiner Software. Meine Arbeit richtet sich nach Design Patterns, ist redundanzfrei, modular und Performance-optimiert.

source: Throughout my career I have gained experience working on short-term projects with different agencies as well as on long-term projects in startups and established companies. I am an experienced and talented team leader and have a strong entrepreneurial spirit.
de: Im Laufe meiner Karriere habe ich Erfahrung gesammelt mit kurzfristigen Projekten in verschiedenen Agenturen sowie mit langfristigen Projekten in Startups und etablierten Unternehmen. Ich bin erfahrener und talentierter Teamleiter und habe einen ausgeprägten unternehmerischen Geist.

source: In my spare time I enjoy different kinds of art and culture. I particularly like life drawing, drawing portraits and comics, playing the guitar and experimenting with digital production of acoustic and visual material. <a href="http://fbrccn.com" title="Filippo Baraccani">Filippo Baraccani</a> and I present our work at <a href="http://notmybiz.com" title="notmybiz.com">notmybiz.com</a>.
de: In meiner Freizeit beschäftige ich mich gern mit Kunst und Kultur jeglicher Facette. Ich zeichne Akte, Porträts und Comics, spiele Gitarre und experimentiere mit digitaler Produktion akustischer und visueller Art. <a title="Filippo Baraccani" href="http://fbrccn.com">Filippo Baraccani</a> und ich stellen unsere Arbeit auf <a title="notmybiz.com" href="http://notmybiz.com">notmybiz.com</a> aus.

source: Web Development
de: Web-Entwicklung

source: Technical Conception
de: Technische Konzeption

source: Backend Development
de: Backend-Entwicklung

source: Webserver Configuration
de: Webserver-Konfiguration

source: Database Design
de: Datenbank-Design

source: Database Conversion
de: Datenbankkonvertierung

source: Data Modeling
de: Datenmodellierung

source: Object-Oriented Programming
de: Objektorientierte Programmierung

source: Performance Optimization
de: Performance-Optimierung

source: Code Generation
de: Code-Generierung

source: Internationalization
de: Internationalisierung

source: Application Monitoring
de: Anwendungsüberwachung

source: Communication Gateways
de: Kommunikationsschnittstellen

source: Scalability
de: Skalierung

source: Regular Expressions
de: Reguläre Ausdrücke

source: Affiliate Systems
de: Affiliate-Systeme

source: Framework Development
de: Framework-Entwicklung

source: Cross-Browser Compatibility
de: Cross-Browser-Kompatibilität

source: Quality Control
de: Qualitätskontrolle

source: Version Control
de: Versionskontrolle

source: Frontend Development
de: Frontend-Entwicklung

source: Content Management Systems
de: Content-Management-Systeme

source: Programming Paradigms
de: Programmierparadigmen

source: Artificial Intelligence
de: Künstliche Intelligenz

source: Search Engine Optimization
de: Suchmaschinenoptimierung

source: Booking Engines
de: Buchungssysteme

source: Data Migration
de: Datenmigration

source: Leadership
de: Personalführung

source: Continuous Integration
de: Kontinuierliche Integration

source: Agile Development
de: Agile Entwicklung

source: Deployment Strategies
de: Deployment-Strategien

source: Product Development
de: Produktentwicklung

source: Projects 2012
de: Projekte 2012

source: projects-2012
de: projekte-2012

source: Projects 2011
de: Projekte 2011

source: projects-2011
de: projekte-2011

source: Older Projects
de: Ältere Projekte

source: older-projects
de: aeltere-projekte

source: Source code
de: Quellcode

source: Combining the principles of <em>rapid development</em> and <em>convention over configuration</em>, the MVC-based web application framework nacho is both lightweight and extremely powerful. Many <em>PHP 5.3</em> features have been utilized in the development of nacho, among others:
de: Die Prinzipien <em>Rapid Development</em> und <em>Convention Over Configuration</em> sind im MVC-basierten Web Application Framework nacho kombiniert. Es ist sowohl leichtgewichtig als auch mächtig in seinen Möglichkeiten und viele <em>PHP 5.3</em>-Features wurden integriert, unter anderem:

source: class abstraction
de: Klassenabstraktion

source: namespaces
de: Namensräume

source: and
de: und

source: Furthermore, the software package provides extensive functionality in means of localization, session and exception handling, request rerouting, templating, output buffering and user input validation. The implemented <em>database abstraction layer</em> is outstanding, supporting database systems from SQL to MS Office.
de: Darüber hinaus bietet das Software-Paket umfangreiche Funktionalität im Bereich Lokalisierung, Session und Exception Handling, Request Rerouting, Templating, Output Buffering sowie User-Input-Validierung. Der <em>Database Abstraction Layer</em> ist herausragend und unterstützt Datenbanksysteme von SQL bis MS Office.

source: Content management system for nacho
de: Content-Management-System für nacho

source: Apart from useful <em>events-based frontend functionality</em> that supports common user interaction patterns, cheese provides secure <em>authentication</em> mechanisms as well as highly flexible <em>CRUD interfaces</em> that can be configured in a clever MVC manner.
de: Außer nützlicher <em>Events-basierter Frontend-Funktionalität</em>, welche verbreitete User-Interaction-Muster unterstützt, bietet cheese sichere Mechanismen für <em>Authentifizierung</em> sowie hochflexible <em>CRUD-Interfaces</em>, die auf clevere MVC-Weise konfiguriert werden können.

source: Coaching Preview
de: Coaching-Vorschau

source: Configure and test Motivado's coaching elements
de: Motivados Coaching-Elemente konfigurieren und testen

source: Import Motivado's coaching models into database
de: Motivados Coaching-Modelle in die Datenbank importieren

source: Test Motivado's coachings before deployment
de: Motivados Coachings vor dem Deployment testen

source: API for Motivado's coaching content
de: API für Motivados Coaching-Inhalte

source: Communication between Motivado's frontend and API
de: Kommunikation zwischen Motivados Frontend und API

source: Library for scraping product catalogues
de: Library für das Scrapen von Produktkatalogen

source: Filtering names
de: Vornamen filtern

source: Filtering names by configurable patterns
de: Vornamen nach konfigurierbaren Mustern filtern

source: Beerball Simulator
de: Bierball-Simulator

source: Simulation of a Beerball match
de: Simulation eines Spiels Bierball

source: JavaScript-based Mortal Kombat tribute
de: JavaScript-basierte Homage an Mortal Kombat

source: Avatar Rating
de: Avatar-Bewertung

source: Rate a selection of avatar images
de: Eine Auswahl Avatar-Bilder bewerten

source: Manage and read your favourite RSS feeds
de: Die persönlichen RSS-Feeds verwalten und lesen

source: Ask and answer questions
de: Fragen stellen und beantworten

source: Dialogues
de: Dialoge

source: Multi-format instant messaging dialogues
de: Chat-Dialoge in verschiedenen Formaten

source: 1 month
de: 1 Monat

source: %d months
de: %d Monate

source: 1 year
de: 1 Jahr

source: %d years
de: %d Jahre

source: since %s
de: seit %s

source: <em>Project CTO</em> at <a href="http://rocket-internet.de" title="Rocket Internet">Rocket Internet GmbH</a>
de: <em>Projekt-CTO</em> bei der <a href="http://rocket-internet.de" title="Rocket Internet">Rocket Internet GmbH</a>

source: At Rocket Internet, I am in charge of coordinating the launches of worldwide e-commerce projects and managing around 100 software engineers, project managers and test analysts.
de: Bei Rocket Internet koordiniere ich die die Inbetriebnahmen von weltweiten E-Commerce-Projekten und leite ein Team aus rund 100 Software-Entwicklern, Projektmanagern und Testanalysten.

source: Senior developer and team leader at <a href="http://rocket-internet.de" title="Rocket Internet">Rocket Internet GmbH</a>
de: Senior Developer und Teamleiter bei der <a href="http://rocket-internet.de" title="Rocket Internet">Rocket Internet GmbH</a>

source: Application architecture and development lead for Rocket's new e-commerce core component
de: Anwendungsarchitektur und Leitung der Entwicklung von Rockets neuer E-Commerce-Core-Komponente

source: Founder and <em>CTO</em> of <a href="http://motivado.de" title="Motivado">Motivado GmbH</a>
de: Gründer und <em>CTO</em> der <a href="http://motivado.de" title="Motivado">Motivado GmbH</a>

source: Motivado is the first platform for interactive video-coaching and assists people in finding solutions for personal issues and achieving goals. We close the gap between cost-intensive personal coaching and the general guidebook market with our approach of mass customization for coaching content.
de: Motivado ist die erste Plattform für interaktives Video-Coaching und unterstützt Menschen dabei, persönliche Probleme zu lösen und Ziele zu erreichen. Mit dem Ansatz der Mass Customization für Coaching-Inhalte in Videoformat schließen wir die Lücke zwischen kostenintensivem persönlichem Coaching und dem populären Ratgebermarkt.

source: I developed Motivado's %scomplex software%s with the support of an agile team of three to seven members. Our innovative technologies have been awarded by Germany's Federal Ministry for Economy and Technology.
de: Motivados %skomplexe Software%s wurde von mir mit Unterstützung eines agilen Teams aus drei bis sieben Personen entwickelt. Unsere innovativen Technologien wurden vom Bundesministerium für Wirtschaft und Technologie ausgezeichnet.

source: We have been live since November 2010 and deliver hundreds of premium quality products to our satisfied customers.
de: Seit November 2010 sind wir live und liefern unseren zufriedenen Kunden Hunderte von Produkten in Premiumqualität.

source: Web and software development
de: Web- und Software-Entwicklung

source: My main focus lies with software architecture, core and backend development, technical conception, prototyping, refactoring and database design. In addition, I am well grounded in usability, search engine optimization and I have an eye for good design.
de: Schwerpunktmäßig arbeite ich im Bereich Software-Architektur, Core- und Backend-Entwicklung, technische Konzeption, Prototyping, Refactoring und Datenbank-Design. Darüber hinaus verfüge ich über weitreichende Kenntnisse zu Benutzerfreundlichkeit und Suchmaschinenoptimierung und habe ein Auge für gutes Design.

source: Freelance work as a senior web developer
de: Freie Mitarbeit als Senior Web Developer

source: for the online agencies
de: für die Online-Agenturen

source: Core and feature development
de: Core und Feature Development

source: for the startup <em>mytourclips AG</em> which covered:
de: für das Startup <em>mytourclips AG</em> in den Bereichen:

source: editiorially maintainable and user-generated content
de: redaktionell gepflegte Inhalte sowie User-Generated Content

source: internationalization, scaling, high availability
de: Internationalisierung, Skalierung, High Availability

source: affiliating, booking engines and content aggregation
de: Affiliating, Buchungssysteme und Content-Aggregation

source: In June 2008 I managed an extensive refactoring of the existing web application on the basis of my web application framework nacho. The goal was to prepare the platform for high traffic and the international establishment of the product.
de: Im Juni 2008 leitete ich ein umfassendes Refactoring der bestehenden Web-Anwendung auf der Basis meines Web Application Frameworks nacho, das die Plattform auf High Traffic und die internationale Etablierung des Produkts vorbereitete.

source: Animation, background/character clean up
de: Animation, Background sowie Character Clean Up

source: and compositing assistance for the cartoon <a href="http://judasandjesus.com" title="Judas &amp; Jesus">Judas &amp; Jesus</a> by <a href="http://inkarnatoons.com" title="Inkarnatoons">Inkarnatoons</a>
de: und Compositing-Assistenz beim Zeichentrickfilm <a href="http://judasandjesus.com" title="Judas &amp; Jesus">Judas &amp; Jesus</a> von <a href="http://inkarnatoons.com" title="Inkarnatoons">Inkarnatoons</a>

source: Software development
de: Software-Entwicklung

source: and website maintenance for the 111 Group and the subsidiary companies of the real estate and tourism branches
de: und Betreuung der Webpräsenzen für die 111 Group und die Tochterunternehmen in den Sparten Immobilien und Touristik

source: I am always looking for exciting new challenges and the opportunity to enhance my skills. If you are interested in a collaboration, please send me an email. I will also gladly provide you with sample work or more detailed project descriptions. You can contact me at:
de: Ich bin immer an spannenden Herausforderungen und der Weiterentwicklung meiner Fähigkeiten interessiert. Gern sende ich Ihnen Arbeitsproben oder detailliertere Projektbeschreibungen zu. Falls Sie Interesse an einer Zusammenarbeit mit mir haben, schreiben Sie bitte an:

source: contact@simsab.net
de: kontakt@simsab.net

source: Contact me
de: Kontaktieren Sie mich

source: Contact me via e-mail
de: Kontaktieren Sie mich via E-Mail

source: Contact me via Skype
de: Kontaktieren Sie mich via Skype

source: You are welcome to visit my profile in the following social networks:
de: Gern können Sie außerdem meine Profile in den folgenden sozialen Netzwerken besuchen:

source: Simon Sablowski at LinkedIn
de: Simon Sablowski bei LinkedIn

source: Simon Sablowski at XING
de: Simon Sablowski bei XING

source: Simon Sablowski at Facebook
de: Simon Sablowski bei Facebook

source: Simon Sablowski at Last.fm
de: Simon Sablowski bei Last.fm

source: Simon Sablowski at YouTube
de: Simon Sablowski bei YouTube

source: Simon Sablowski at IMDb
de: Simon Sablowski bei IMDb

source: legal-notice
de: impressum

source: Legal notice
de: Impressum
